; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics-strips) ;; Actually, this domain is not strips, but I use that name so that it matches the domain name of the problems generated

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem logistics-c4-s1-p3-a1)
(:domain logistics-strips)
(:objects a0 - airplane
          c0 c1 c2 c3 - city
          t0 t1 t2 t3 t4 t5 t6 t7 t8 t9 t10 - truck
          l0-0 l1-0 l2-0 l3-0 - airport
          p0 p1 p2 - package
)
(:init
    (in-city  l0-0 c0)
    (in-city  l1-0 c1)
    (in-city  l2-0 c2)
    (in-city  l3-0 c3)
    (at t0 l0-0)
    (at t1 l1-0)
    (at t2 l2-0)
    (at t3 l3-0)
    (at t4 l2-0)
    (at t5 l1-0)
    (at t6 l0-0)
    (at t7 l3-0)
    (at t8 l2-0)
    (at t9 l2-0)
    (at t10 l2-0)
    (at p0 l3-0)
    (at p1 l1-0)
    (at p2 l0-0)
    (at a0 l2-0)
)
(:goal
    (and
        (at p0 l0-0)
        (at p1 l3-0)
        (at p2 l0-0)
    )
)
)

; plan
1. (fly a0 l2-0 l1-0)
   deleted: (at a0 l2-0)
   added: (at a0 l1-0)
   goals met: 1 of 3
2. (load a0 p1 l1-0)
   deleted: (at p1 l1-0)
   added: (in p1 a0)
   goals met: 1 of 3
3. (fly a0 l1-0 l3-0)
   deleted: (at a0 l1-0)
   added: (at a0 l3-0)
   goals met: 1 of 3
4. (unload a0 p1 l3-0)
   deleted: (in p1 a0)
   added: (at p1 l3-0)
   goals met: 2 of 3
5. (load a0 p0 l3-0)
   deleted: (at p0 l3-0)
   added: (in p0 a0)
   goals met: 2 of 3
6. (fly a0 l3-0 l0-0)
   deleted: (at a0 l3-0)
   added: (at a0 l0-0)
   goals met: 2 of 3
7. (unload a0 p0 l0-0)
   deleted: (in p0 a0)
   added: (at p0 l0-0)
   goals met: 3 of 3
